In [64]:
import pandas as pd

In [148]:
df = pd.read_csv("salaries_by_college_major.csv")
df.head(3)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"42,600.00","71,900.00","36,300.00","150,000.00",Business

## Data Exploration and Data Cleaning

In [6]:
df.shape

(51, 6)

In [7]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [9]:
df.isna().tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,False,False,False,False,False,False
47,False,False,False,False,False,False
48,False,False,False,False,False,False
49,False,False,False,False,False,False
50,False,True,True,True,True,True

In [10]:
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

## Accessing Columns and Individual Cells in a DF

### College Major with Highest Starting Salaries

In [34]:
print(f"The highest starting salary is: {clean_df['Starting Median Salary'].max()}")
f"College Major with the Max Starting Salary: {clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmax()]}"

The highest starting salary is: 74300.0

'College Major with the Max Starting Salary: Physician Assistant'

### College Major with Highest Mid-Career Salary

In [37]:
print(f"The highest mid-career salary is: {clean_df['Mid-Career Median Salary'].max()}")
f"College Major with the Max Mid-Career Salary: {clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmax()]}"

The highest mid-career salary is: 107000.0

'College Major with the Max Mid-Career Salary: Chemical Engineering'

### College Major with Lowest Starting Salary

In [39]:
print(f"The lowest starting salary is: {clean_df['Starting Median Salary'].min()}")
f"College Major with the Min Starting Salary: {clean_df['Undergraduate Major'].loc[clean_df['Starting Median Salary'].idxmin()]}"

The lowest starting salary is: 34000.0

'College Major with the Min Starting Salary: Spanish'

### College Major with Lowest Mid-Career Salary

In [41]:
print(f"The lowest mid-career salary is: {clean_df['Mid-Career Median Salary'].min()}")
f"College Major with the Min Mid-Career Salary: {clean_df['Undergraduate Major'].loc[clean_df['Mid-Career Median Salary'].idxmin()]}"

The lowest mid-career salary is: 52000.0

'College Major with the Min Mid-Career Salary: Education'

## Sorting Values & Adding Columns

### Majors with the Most Potential vs Lowest Risk

In [43]:
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, 'Spread', spread_col)
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [52]:
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [58]:
high_risk = clean_df.sort_values('Spread', ascending = False)
high_risk[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [57]:
highest_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary')
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

           Undergraduate Major  Mid-Career 90th Percentile Salary
49                     Spanish                            96400.0
47                    Religion                            96400.0
40                     Nursing                            98300.0
41                   Nutrition                            99200.0
27  Health Care Administration                           101000.0

## Grouping and Pivoting Data

In [59]:
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [70]:
#Average Salary by Group
pd.options.display.float_format = '{:,.2f}'.format
clean_df.groupby('Group').mean(numeric_only=True)

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

### Extra Credit ###
The PayScale dataset used in this lesson was from 2008 and looked at the prior 10 years. Notice how Finance ranked very high on post-degree earnings at the time. However, we all know there was a massive financial crash in that year. Perhaps things have changed.

In [5]:
from bs4 import BeautifulSoup
import requests

In [138]:
degree = []
start_salary = []
mid_salary = []

In [139]:
for page_num in range(1, 34):
    response = requests.get(f"https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors/page/{page_num}")
    payscale_page = response.text
    soup = BeautifulSoup(payscale_page, 'html.parser')
    all_data = soup.find_all(class_="data-table__row")
    for data in all_data:
        split_data = data.text.split(":")
        degree.append(split_data[2].split('Degree')[0])
        start_salary.append(float(split_data[4].split('Mid')[0].split('$')[1].replace(",", "")))
        mid_salary.append(float(split_data[5].split('%')[0].split('$')[1].replace(",", "")))

In [140]:
data_dict = {
    'Major': degree,
    'Starting Salary': start_salary,
    'Mid-Career Salary': mid_salary,
}

In [179]:
updated_salaries = pd.DataFrame(data_dict)

In [180]:
updated_salaries

,Major,Starting Salary,Mid-Career Salary
0,Petroleum Engineering,"93,200.00","187,300.00"
1,Operations Research & Industrial Engineering,"84,800.00","170,400.00"
2,Electrical Engineering & Computer Science (EECS),"108,500.00","159,300.00"
3,Interaction Design,"68,300.00","155,800.00"
4,Public Accounting,"59,800.00","147,700.00"
...,...,...,...
820,Child & Family Studies,"36,400.00","46,500.00"
821,Rehabilitation Counseling,"39,200.00","46,400.00"
822,Outdoor Education,"37,400.00","46,300.00"
823,Early Childhood Education,"36,100.00","45,400.00"
824,Mental Health,"36,900.00","45,000.00"